<a href="https://colab.research.google.com/github/miller00315/estatistica_machine_learning/blob/master/Percentuais_e_taxas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
data = {'job': ['data_base_admnistrator', 'programmer', 'network_architect'],
        'new_jersey': [97350, 82080,112840],
        'florida': [77140, 71540, 62310]}

In [3]:
type(data)

dict

In [4]:
data

{'florida': [77140, 71540, 62310],
 'job': ['data_base_admnistrator', 'programmer', 'network_architect'],
 'new_jersey': [97350, 82080, 112840]}

In [5]:
dataset = pd.DataFrame(data)

In [6]:
dataset

                      job  new_jersey  florida
0  data_base_admnistrator       97350    77140
1              programmer       82080    71540
2       network_architect      112840    62310

In [7]:
dataset['new_jersey'].sum()

292270

In [8]:
dataset['florida'].sum()

210990

In [9]:
dataset['%_new_jersey'] = (dataset['new_jersey'] / dataset['new_jersey'].sum()) * 100

In [10]:
dataset

                      job  new_jersey  florida  %_new_jersey
0  data_base_admnistrator       97350    77140     33.308242
1              programmer       82080    71540     28.083621
2       network_architect      112840    62310     38.608136

In [11]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100

In [12]:
dataset

                      job  new_jersey  florida  %_new_jersey  %_florida
0  data_base_admnistrator       97350    77140     33.308242  36.560974
1              programmer       82080    71540     28.083621  33.906820
2       network_architect      112840    62310     38.608136  29.532205

In [13]:
dataset = pd.read_csv('census.csv')

In [14]:
dataset.head()

   age          workclass  final-weight  ... hour-per-week  native-country  income
0   39          State-gov         77516  ...            40   United-States   <=50K
1   50   Self-emp-not-inc         83311  ...            13   United-States   <=50K
2   38            Private        215646  ...            40   United-States   <=50K
3   53            Private        234721  ...            40   United-States   <=50K
4   28            Private        338409  ...            40            Cuba   <=50K

[5 rows x 15 columns]

In [17]:
reduced_dataset = dataset[['income', 'education']] # faço um filtro que seleciona apenas os items que necessito

In [19]:
reduced_dataset.head()

   income   education
0   <=50K   Bachelors
1   <=50K   Bachelors
2   <=50K     HS-grad
3   <=50K        11th
4   <=50K   Bachelors

In [20]:
agrouped_dataset = reduced_dataset.groupby(['education', 'income'])['education'].count()

In [21]:
agrouped_dataset

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [22]:
agrouped_dataset.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [26]:
agrouped_dataset[' Bachelors', ' <=50K'], agrouped_dataset[' Bachelors', ' >50K']

(3134, 2221)

In [27]:
total = agrouped_dataset[' Bachelors', ' <=50K'] + agrouped_dataset[' Bachelors', ' >50K']

In [28]:
total

5355

In [29]:
percentage_under_50k = (agrouped_dataset[' Bachelors', ' <=50K'] / total) * 100

In [30]:
percentage_under_50k

58.52474323062559

In [31]:
percentage_over_50k = (agrouped_dataset[' Bachelors', ' >50K'] / total) * 100
percentage_over_50k

41.47525676937442

Indíces, coeficientes e taxas

In [53]:
 school_data = {'Ano graduação': ['1º', '2º', '3º', '4º', 'Total'],
                'Matriculas março': [70,50,47, 23, 190],
                'Matriculas novembro': [65, 48,40, 22, 175]}

In [54]:
school_dataset = pd.DataFrame(school_data)
school_dataset

  Ano graduação  Matriculas março  Matriculas novembro
0            1º                70                   65
1            2º                50                   48
2            3º                47                   40
3            4º                23                   22
4         Total               190                  175

In [55]:
school_dataset['Taxa evasão'] = ((school_dataset['Matriculas março'] - school_dataset['Matriculas novembro']) / school_dataset['Matriculas março']) *100

In [56]:
school_dataset

  Ano graduação  Matriculas março  Matriculas novembro  Taxa evasão
0            1º                70                   65     7.142857
1            2º                50                   48     4.000000
2            3º                47                   40    14.893617
3            4º                23                   22     4.347826
4         Total               190                  175     7.894737